ranjithaguna/pv/LED_Demo/source/pic32cx/component/week.h
/**
 * \brief Component description for PIC32CX/0525SG12 WEEK
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_WEEK_COMPONENT_H_
#define _PIC32CX_0525SG12_WEEK_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_WEEK The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR WEEK */
/* ========================================================================== */

/* -------- WEEK_CONTROL_REGISTER : (WEEK Offset: 0x00) (R/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t WT_ENABLE:1;               /**< bit:      0  The WT_ENABLE bit is used to start and stop the Week Alarm Counter Register and the Clock Divider Register.\n     The value in the Counter Register is held when the WT_ENABLE bit is not asserted (0) and the count is resumed from the last value when the bit is asserted (1).\n     The 15-Bit Clock Divider is reset to 00h and the Week Alarm Interface is in its lowest power consumption state when the WT_ENABLE bit is not asserted. */
    uint32_t :5;                        /**< bit:   1..5  Reserved                                      */
    uint32_t POWERUP_EN:1;              /**< bit:      6  This bit controls the state of the Power-Up Event Output and enables Week POWER-UP Event decoding in the VBAT-Powered Control Interface.\n     1=Power-Up Event Output Enabled\n     0=Power-Up Event Output Disabled and Reset */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __WEEK_CONTROL_REGISTER_bits_t;
#define WEEK_CONTROL_REGISTER_RESETVALUE    (0x01U)                                       /**<  (WEEK_CONTROL_REGISTER) Control Register  Reset Value */

#define WEEK_CONTROL_REGISTER_WT_ENABLE_Pos   (0)                                            /**< (WEEK_CONTROL_REGISTER) The WT_ENABLE bit is used to start and stop the Week Alarm Counter Register and the Clock Divider Register.\n     The value in the Counter Register is held when the WT_ENABLE bit is not asserted (0) and the count is resumed from the last value when the bit is asserted (1).\n     The 15-Bit Clock Divider is reset to 00h and the Week Alarm Interface is in its lowest power consumption state when the WT_ENABLE bit is not asserted. Position */
#define WEEK_CONTROL_REGISTER_WT_ENABLE_Msk   (0x1U << WEEK_CONTROL_REGISTER_WT_ENABLE_Pos)  /**< (WEEK_CONTROL_REGISTER) The WT_ENABLE bit is used to start and stop the Week Alarm Counter Register and the Clock Divider Register.\n     The value in the Counter Register is held when the WT_ENABLE bit is not asserted (0) and the count is resumed from the last value when the bit is asserted (1).\n     The 15-Bit Clock Divider is reset to 00h and the Week Alarm Interface is in its lowest power consumption state when the WT_ENABLE bit is not asserted. Mask */
#define WEEK_CONTROL_REGISTER_POWERUP_EN_Pos  (6)                                            /**< (WEEK_CONTROL_REGISTER) This bit controls the state of the Power-Up Event Output and enables Week POWER-UP Event decoding in the VBAT-Powered Control Interface.\n     1=Power-Up Event Output Enabled\n     0=Power-Up Event Output Disabled and Reset Position */
#define WEEK_CONTROL_REGISTER_POWERUP_EN_Msk  (0x1U << WEEK_CONTROL_REGISTER_POWERUP_EN_Pos)  /**< (WEEK_CONTROL_REGISTER) This bit controls the state of the Power-Up Event Output and enables Week POWER-UP Event decoding in the VBAT-Powered Control Interface.\n     1=Power-Up Event Output Enabled\n     0=Power-Up Event Output Disabled and Reset Mask */
#define WEEK_CONTROL_REGISTER_Msk             (0x00000041UL)                                 /**< (WEEK_CONTROL_REGISTER) Register Mask  */

/* -------- WEEK_ALARM_COUNTER : (WEEK Offset: 0x04) (R/W 32) Week Alarm Counter Register -------- */

typedef union
{
  struct
  {
    uint32_t WEEK_COUNTER:28;           /**< bit:  0..27  While the WT_ENABLE bit is 1, this register is incremented at a 1 Hz rate. Writes of this register may require one second\n     to take effect. Reads return the current state of the register. Reads and writes complete independently of the state of WT_ENABLE. */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __WEEK_ALARM_COUNTER_bits_t;
#define WEEK_ALARM_COUNTER_RESETVALUE       (0x00U)                                       /**<  (WEEK_ALARM_COUNTER) Week Alarm Counter Register  Reset Value */

#define WEEK_ALARM_COUNTER_WEEK_COUNTER_Pos   (0)                                            /**< (WEEK_ALARM_COUNTER) While the WT_ENABLE bit is 1, this register is incremented at a 1 Hz rate. Writes of this register may require one second\n     to take effect. Reads return the current state of the register. Reads and writes complete independently of the state of WT_ENABLE. Position */
#define WEEK_ALARM_COUNTER_WEEK_COUNTER_Msk   (0xFFFFFFFU << WEEK_ALARM_COUNTER_WEEK_COUNTER_Pos)  /**< (WEEK_ALARM_COUNTER) While the WT_ENABLE bit is 1, this register is incremented at a 1 Hz rate. Writes of this register may require one second\n     to take effect. Reads return the current state of the register. Reads and writes complete independently of the state of WT_ENABLE. Mask */
#define WEEK_ALARM_COUNTER_WEEK_COUNTER(value) (WEEK_ALARM_COUNTER_WEEK_COUNTER_Msk & ((value) << WEEK_ALARM_COUNTER_WEEK_COUNTER_Pos))
#define WEEK_ALARM_COUNTER_Msk                (0x0FFFFFFFUL)                                 /**< (WEEK_ALARM_COUNTER) Register Mask  */

