ranjithaguna/pv/LED_Demo/source/pic32cx/component/week.h
#define WEEK_BGPO_RESET_BGPO_RESET_Pos        (0)                                            /**< (WEEK_BGPO_RESET) Battery powered General Purpose Output reset event. For each bit [i] in the field:\n     1=BGPO[i] is reset to 0 on RESET_VTR; 0=BGPO[i] is reset to 0 on RESET_SYS. Position */
#define WEEK_BGPO_RESET_BGPO_RESET_Msk        (0x7U << WEEK_BGPO_RESET_BGPO_RESET_Pos)       /**< (WEEK_BGPO_RESET) Battery powered General Purpose Output reset event. For each bit [i] in the field:\n     1=BGPO[i] is reset to 0 on RESET_VTR; 0=BGPO[i] is reset to 0 on RESET_SYS. Mask */
#define WEEK_BGPO_RESET_BGPO_RESET(value)     (WEEK_BGPO_RESET_BGPO_RESET_Msk & ((value) << WEEK_BGPO_RESET_BGPO_RESET_Pos))
#define WEEK_BGPO_RESET_Msk                   (0x00000007UL)                                 /**< (WEEK_BGPO_RESET) Register Mask  */

/** \brief WEEK register offsets definitions */
#define WEEK_CONTROL_REGISTER_OFFSET (0x00)         /**< (WEEK_CONTROL_REGISTER) Control Register Offset */
#define WEEK_ALARM_COUNTER_OFFSET    (0x04)         /**< (WEEK_ALARM_COUNTER) Week Alarm Counter Register Offset */
#define WEEK_TIMER_COMPARE_OFFSET    (0x08)         /**< (WEEK_TIMER_COMPARE) Week Timer Compare Register Offset */
#define WEEK_CLOCK_DIVIDER_OFFSET    (0x0C)         /**< (WEEK_CLOCK_DIVIDER) Clock Divider Register Offset */
#define WEEK_SUB_SECOND_INT_SELECT_OFFSET (0x10)         /**< (WEEK_SUB_SECOND_INT_SELECT) Sub-Second Programmable Interrupt Select Register Offset */
#define WEEK_SUB_WEEK_CONTROL_OFFSET (0x14)         /**< (WEEK_SUB_WEEK_CONTROL) Sub-Week Control Register Offset */
#define WEEK_SUB_WEEK_ALARM_COUNTER_OFFSET (0x18)         /**< (WEEK_SUB_WEEK_ALARM_COUNTER) Sub-Week Alarm Counter Register Offset */
#define WEEK_BGPO_DATA_OFFSET        (0x1C)         /**< (WEEK_BGPO_DATA) BGPO Data Register Offset */
#define WEEK_BGPO_POWER_OFFSET       (0x20)         /**< (WEEK_BGPO_POWER) BGPO Power Register Offset */
#define WEEK_BGPO_RESET_OFFSET       (0x24)         /**< (WEEK_BGPO_RESET) BGPO Reset Register Offset */

/** \brief WEEK register API structure */
typedef struct
{  /* The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */
  __IO  __WEEK_CONTROL_REGISTER_bits_t CONTROL_REGISTER; /**< Offset: 0x00 (R/W  32) Control Register */
  __IO  __WEEK_ALARM_COUNTER_bits_t    WEEK_ALARM_COUNTER; /**< Offset: 0x04 (R/W  32) Week Alarm Counter Register */
  __IO  __WEEK_TIMER_COMPARE_bits_t    WEEK_TIMER_COMPARE; /**< Offset: 0x08 (R/W  32) Week Timer Compare Register */
  __IO  __WEEK_CLOCK_DIVIDER_bits_t    CLOCK_DIVIDER; /**< Offset: 0x0C (R/W  32) Clock Divider Register */
  __IO  __WEEK_SUB_SECOND_INT_SELECT_bits_t SUB_SECOND_INT_SELECT; /**< Offset: 0x10 (R/W  32) Sub-Second Programmable Interrupt Select Register */
  __I   __WEEK_SUB_WEEK_CONTROL_bits_t SUB_WEEK_CONTROL; /**< Offset: 0x14 (R/   32) Sub-Week Control Register */
  __I   __WEEK_SUB_WEEK_ALARM_COUNTER_bits_t SUB_WEEK_ALARM_COUNTER; /**< Offset: 0x18 (R/   32) Sub-Week Alarm Counter Register */
  __IO  __WEEK_BGPO_DATA_bits_t        BGPO_DATA;     /**< Offset: 0x1C (R/W  32) BGPO Data Register */
  __IO  __WEEK_BGPO_POWER_bits_t       BGPO_POWER;    /**< Offset: 0x20 (R/W  32) BGPO Power Register */
  __IO  __WEEK_BGPO_RESET_bits_t       BGPO_RESET;    /**< Offset: 0x24 (R/W  32) BGPO Reset Register */
} week_registers_t;
/** @}  end of The Week Alarm Interface provides two timekeeping functions: a Week Timer and a Sub-Week Timer. Both the Week Timer\n    and the Sub-Week Timer assert the Power-Up Event Output which automatically powers-up the system from the G3 state. */

#endif /* _PIC32CX_0525SG12_WEEK_COMPONENT_H_ */
